brew "mas"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "ibrahimbutt/dotfiles"

# eq `brew install <name>`
brew "bat"
brew "bitwarden-cli"
brew "gh"
brew "go"
brew "gradle"
brew "httpie"
brew "maven"
brew "node"
brew "postgresql@14"
brew "rustup-init"
brew "sqlite"

# eq `brew install --cask <name>`
cask "docker"
cask "figma"
cask "google-chrome"
cask "iina"
cask "jetbrains-toolbox"
cask "obsidian"
cask "postman"
cask "raycast"
cask "transmission"
cask "ibrahimbutt/dotfiles/dockutil", args: { no_quarantine: true }

# eq `mas install <id>` 
mas "Keystroke Pro", id: 1572206224
mas "Magnet", id: 441258766
mas "Things 3", id: 904280696
mas "Xcode", id: 497799835

